In [212]:
import numpy as np
import pandas as pd

In [213]:
"""
TOPICS:
1. Dataframe - conditional feature/data extraction
2. Resetting/renaming labels 

"""

'\nTOPICS:\n1. Dataframe - conditional feature/data extraction\n2. Resetting/renaming labels \n\n'

In [214]:
#create pandas dataframe
index = ['i', 'j', 'k']
columns = ['a', 'b', 'c', 'd']
np.random.seed(10)
mylist = np.random.randint(0, 100, (3,4))
df = pd.DataFrame(data = mylist, index = index, columns = columns)
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [215]:
#conditional data extraction

In [216]:
#boolean dataframe
df > 0

      a      b     c     d
i  True   True  True  True
j  True   True  True  True
k  True  False  True  True

In [217]:
#Extract all the elements which are greater than 0
df[df>0]

    a     b   c   d
i   9  15.0  64  28
j  89  93.0  29   8
k  73   NaN  40  36

In [218]:
#Extract all the elements which are greater than 80
df[df>50]

      a     b     c   d
i   NaN   NaN  64.0 NaN
j  89.0  93.0   NaN NaN
k  73.0   NaN   NaN NaN

In [219]:
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [220]:
#Filter a column/feature
#Extract elements of a given column/feature for based on given condition
df['a'] > 50

i    False
j     True
k     True
Name: a, dtype: bool

In [221]:
#extract elements for which feature vecor/column 'a' values are greater than 50
df[df['a'] > 50]

    a   b   c   d
j  89  93  29   8
k  73   0  40  36

In [222]:
#grab only column 'a' elements for which data > 50
df[df['a'] > 50]['a']

j    89
k    73
Name: a, dtype: int32

In [223]:
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [224]:
#conditional extraction steps
#step1 : write individual conditions for columns enclosed in parentheses 
    #ex: (df['a'] > 50) (df['b'] < 50)
#step2 : use &(AND) or |(OR)
    #ex: (df['a'] > 50) & (df['b'] < 50)
#step3 : use the above conditional statement for the source dataframe
    #ex: df[(df['a'] > 50) | (df['b'] < 50)]

df[(df['a'] > 50) | (df['b'] > 50)]

    a   b   c   d
j  89  93  29   8
k  73   0  40  36

In [225]:
df

    a   b   c   d
i   9  15  64  28
j  89  93  29   8
k  73   0  40  36

In [226]:
#adding new column using list
new_coulmn = ['ap', 'tn','ka'] 
df['name'] = new_coulmn
df

    a   b   c   d name
i   9  15  64  28   ap
j  89  93  29   8   tn
k  73   0  40  36   ka

In [227]:
#column labels
df.columns

Index(['a', 'b', 'c', 'd', 'name'], dtype='object')

In [228]:
#reset named index to integer indexing
df.reset_index()

  index   a   b   c   d name
0     i   9  15  64  28   ap
1     j  89  93  29   8   tn
2     k  73   0  40  36   ka

In [229]:
df

    a   b   c   d name
i   9  15  64  28   ap
j  89  93  29   8   tn
k  73   0  40  36   ka

In [230]:
#renaming index labels using existing columns 
df = df.set_index('name')
#NOTE: here 'name' is not a column anymore, it becomes label for index/rows

In [231]:
#column labels
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [235]:
#details of the dataframe
df.describe()

               a          b          c          d
count   3.000000   3.000000   3.000000   3.000000
mean   57.000000  36.000000  44.333333  24.000000
std    42.332021  49.929951  17.897858  14.422205
min     9.000000   0.000000  29.000000   8.000000
25%    41.000000   7.500000  34.500000  18.000000
50%    73.000000  15.000000  40.000000  28.000000
75%    81.000000  54.000000  52.000000  32.000000
max    89.000000  93.000000  64.000000  36.000000

In [233]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, ap to ka
Data columns (total 4 columns):
a    3 non-null int32
b    3 non-null int32
c    3 non-null int32
d    3 non-null int32
dtypes: int32(4)
memory usage: 72.0+ bytes

In [234]:
df.dtypes

a    int32
b    int32
c    int32
d    int32
dtype: object